//
//  ImageUtil.h
//  Stg14
//
//  Created by 永瀬鈴久 on 2014/05/16.
//
//	2014/05/16		永瀬鈴久
//
//		画像とテクスチャを汎用的に扱うモジュール
//

#ifndef __Stg14__ImageUtil__
#define __Stg14__ImageUtil__

#include "cocos2d.h"

//=============================================================================
//	_tagTEXTURE
//		テクスチャ
//	-----------------------------------------------------------------------
//	cocos2d の Image と Texture が分離しているというわかりづらい特性を解消する為に作成
//=============================================================================
struct _tagTEXTURE
{
	std::string			m_fileName ;
	cocos2d::Image*		m_pImage ;			// 画像を
	cocos2d::Texture2D*	m_pTexture ;
};

typedef struct _tagTEXTURE TEXTURE ;

//=============================================================================
//	loadImage
//		画像の読み込み
//	-----------------------------------------------------------------------
//	INPUT:	std::string						ファイル名
//			TEXTURE*						テクスチャ
//	OUTPUT:	bool	true...読み込み成功
//					false...読み込み失敗
//=============================================================================
bool loadImage( const std::string& fileName, TEXTURE* pTex ) ;

//=============================================================================
//	releaseTexture
//		開放するテクスチャ
//	-----------------------------------------------------------------------
//	INPUT:	TEXTURE*						テクスチャ
//	OUTPUT:	void
//=============================================================================
void releaseTexture( TEXTURE* pTex ) ;

#endif /* defined(__Stg14__ImageUtil__) */
